#include "H/Function_Init.H"

void EX_Init(void);

/*****************************************************
*函数名称：void EXTI_Test(void)
*函数功能：外部中断测试
*入口参数：void
*出口参数：void
*****************************************************/
void EXTI_Test(void)
{
	EX_Init();
	while(1)
	{
	}
}
/*****************************************************
*函数名称：void EX_Init(void)
*函数功能：外部中断初始化
*入口参数：void
*出口参数：void
*****************************************************/
void EX_Init(void)
{	
	P0CON&= 0XCF;     //中断IO口设置为高阻输入
	P0PH |= 0x30;
	P1CON&= 0XF1;     //中断IO口设置为高阻输入
	P1PH |= 0x0E;
	P2CON&= 0XFC;     //中断IO口设置为高阻输入
	P2PH |= 0x03;

	INT0F = 0X0E ;//xxxx 0000  0关闭 1使能
  INT2F = 0X33 ;//0000 xxxx  0关闭 1使能	
	INT0R = 0X0E ;//xxxx 0000  0关闭 1使能
	INT2R = 0X33 ;//0000 xxxx  0关闭 1使能	
	
	//测试全部外部中断功能
	IE |= 0x01;	//0000 0x0x
	IE1|= 0x08;	//0000 x000  INT2使能
	IP |= 0X00; //优先级设置
	IP1|= 0X00;
	EA = 1;
}

/*****************************************************
*函数名称：void EX0/1/2() interrupt	0/2/10
*函数功能：外部中断初始化
*入口参数：void
*出口参数：void
*****************************************************/
void EX0() interrupt	0
{
   P02 = ~P02;
}

void EX2() interrupt	10
{
   P04 = ~P04;
}
